cmsis-svd/cmsis-svd/data/Renesas/R7FA4W1.svd
                <register>
                    <name>SD_CLK_CTRL</name>
                    <description>SD Clock Control Register</description>
                    <addressOffset>0x048</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000020</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>10</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLKOFFEN</name>
                            <description>SD/MMC Clock Output Automatic Control Enable</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Automatic control for SD/MMC Clock output is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Automatic control for SD/MMC Clock output is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLKEN</name>
                            <description>SD/MMC Clock Output Control Enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>SD/MMC Clock output is disabled. The SDCLK signal is fixed 0.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>SD/MMC Clock output is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLKSEL</name>
                            <description>SDHI Clock Frequency Select</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x00</name>
                                    <description>PCLKA divided by 2</description>
                                    <value>0x00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x01</name>
                                    <description>PCLKA divided by 4</description>
                                    <value>0x01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x02</name>
                                    <description>PCLKA divided by 8</description>
                                    <value>0x02</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x04</name>
                                    <description>PCLKA divided by 16</description>
                                    <value>0x04</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x08</name>
                                    <description>PCLKA divided by 32</description>
                                    <value>0x08</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x10</name>
                                    <description>PCLKA divided by 64</description>
                                    <value>0x10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x20</name>
                                    <description>PCLKA divided by 128</description>
                                    <value>0x20</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x40</name>
                                    <description>PCLKA divided by 256</description>
                                    <value>0x40</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x80</name>
                                    <description>PCLKA divided by 512</description>
                                    <value>0x80</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Settings prohibited.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_SIZE</name>
                    <description>Transfer Data Length Register</description>
                    <addressOffset>0x04C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000200</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000000000. The write value should be 0000000000000000000000.</description>
                            <lsb>10</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LEN</name>
                            <description>Transfer Data SizeThese bits specify a size between 1 and 512 bytes for the transfer of single blocks.In cases of multiple block transfer with automatic issuing of CMD12 (CMD18 and CMD25), the only specifiable transfer data size is 512 bytes. Furthermore, in cases of multiple block transfer without automatic issuing of CMD12, as well as 512 bytes, 32, 64, 128, and 256 bytes are specifiable. However, in the reading of 32, 64, 128, and 256 bytes for the transfer of multiple blocks, this is restricted to multiple block transfer by CMD53.Additionally, if a command accompanies data transfer, do not set these bits to 0.</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_OPTION</name>
                    <description>SD Card Access Control Option Register</description>
                    <addressOffset>0x050</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x000040EE</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WIDTH</name>
                            <description>Bus WidthNOTE: The initial value is applied at a reset and when the SOFT_RST.SDRST flag is 0.</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>4-bit width (WIDTH8=0) / 8-bit width (WIDTH8=1)  </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>1-bit width (WIDTH8=0 or 1 ) </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 1. The write value should be 1.</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WIDTH8</name>
                            <description>Bus Widthsee b15, WIDTH bit</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000. The write value should be 0000.</description>
                            <lsb>9</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOUTMASK</name>
                            <description>Timeout MASKWhen timeout occurs in case of inactivating timeout, software reset should be executed to terminate command sequence.</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Activate Timeout</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Inactivate Timeout(RSPTO bit and DTO bit of SD_INFO2 and SD_ERR_STS2 won't be set)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TOP</name>
                            <description>Timeout Counter</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1111</name>
                                    <description>Setting prohibited</description>
                                    <value>#1111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>SDHI clock x 2^(TOP+13)</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTOP</name>
                            <description>Card Detection Time Counter</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1111</name>
                                    <description>Setting prohibited</description>
                                    <value>#1111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>PCLKA x 2^(TOP+10)</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
